; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob35) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate4)
	(at pallet1 distributor0)
	(clear crate8)
	(at pallet2 distributor1)
	(clear crate10)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 456)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 355)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor1)
	(on crate0 pallet2)
	(= (weight crate0) 47)
	(at crate1 distributor1)
	(on crate1 crate0)
	(= (weight crate1) 76)
	(at crate2 distributor0)
	(on crate2 pallet1)
	(= (weight crate2) 65)
	(at crate3 depot0)
	(on crate3 pallet0)
	(= (weight crate3) 96)
	(at crate4 depot0)
	(on crate4 crate3)
	(= (weight crate4) 82)
	(at crate5 distributor1)
	(on crate5 crate1)
	(= (weight crate5) 36)
	(at crate6 distributor0)
	(on crate6 crate2)
	(= (weight crate6) 73)
	(at crate7 distributor0)
	(on crate7 crate6)
	(= (weight crate7) 79)
	(at crate8 distributor0)
	(on crate8 crate7)
	(= (weight crate8) 90)
	(at crate9 distributor1)
	(on crate9 crate5)
	(= (weight crate9) 52)
	(at crate10 distributor1)
	(on crate10 crate9)
	(= (weight crate10) 36)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate7)
		(on crate1 crate0)
		(on crate2 crate8)
		(on crate3 crate10)
		(on crate4 pallet1)
		(on crate5 crate3)
		(on crate6 crate5)
		(on crate7 crate4)
		(on crate8 pallet2)
		(on crate9 crate6)
		(on crate10 pallet0)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 0 to 10
   goals met: 1 of 11
2. (lift hoist2 crate10 crate9 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist2) (on crate10 crate9)
   added: (lifting hoist2 crate10) (clear crate9)
   changed: (fuel-cost) from 10 to 11
   goals met: 1 of 11
3. (lift hoist1 crate8 crate7 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist1) (on crate8 crate7)
   added: (lifting hoist1 crate8) (clear crate7)
   changed: (fuel-cost) from 11 to 12
   goals met: 1 of 11
4. (lift hoist0 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate3)
   added: (lifting hoist0 crate4) (clear crate3)
   changed: (fuel-cost) from 12 to 13
   goals met: 1 of 11
5. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 13 to 23
   goals met: 1 of 11
6. (load hoist2 crate10 truck0 distributor1)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 36
   goals met: 1 of 11
7. (lift hoist2 crate9 crate5 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist2) (on crate9 crate5)
   added: (lifting hoist2 crate9) (clear crate5)
   changed: (fuel-cost) from 23 to 24
   goals met: 1 of 11
8. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 24 to 34
   goals met: 1 of 11
9. (load hoist1 crate8 truck0 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   changed: (current_load truck0) from 36 to 126
   goals met: 1 of 11
10. (lift hoist1 crate7 crate6 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate6)
   added: (lifting hoist1 crate7) (clear crate6)
   changed: (fuel-cost) from 34 to 35
   goals met: 1 of 11
11. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   changed: (current_load truck0) from 126 to 205
   goals met: 1 of 11
12. (unload hoist1 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck0) from 205 to 169
   goals met: 1 of 11
13. (load hoist2 crate9 truck1 distributor1)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 52
   goals met: 1 of 11
14. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 35 to 45
   goals met: 1 of 11
15. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 45 to 55
   goals met: 1 of 11
16. (load hoist1 crate10 truck1 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck1) (available hoist1)
   changed: (current_load truck1) from 52 to 88
   goals met: 1 of 11
17. (lift hoist2 crate5 crate1 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate1)
   added: (lifting hoist2 crate5) (clear crate1)
   changed: (fuel-cost) from 55 to 56
   goals met: 1 of 11
18. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 56 to 66
   goals met: 1 of 11
19. (lift hoist1 crate6 crate2 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate2)
   added: (lifting hoist1 crate6) (clear crate2)
   changed: (fuel-cost) from 66 to 67
   goals met: 1 of 11
20. (drop hoist0 crate4 crate3 depot0)
   deleted: (lifting hoist0 crate4) (clear crate3)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate3)
   goals met: 1 of 11
21. (load hoist2 crate5 truck1 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   changed: (current_load truck1) from 88 to 124
   goals met: 1 of 11
22. (lift hoist2 crate1 crate0 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist2) (on crate1 crate0)
   added: (lifting hoist2 crate1) (clear crate0)
   changed: (fuel-cost) from 67 to 68
   goals met: 0 of 11
23. (lift hoist0 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate3)
   added: (lifting hoist0 crate4) (clear crate3)
   changed: (fuel-cost) from 68 to 69
   goals met: 0 of 11
24. (load hoist2 crate1 truck1 distributor1)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck1) (available hoist2)
   changed: (current_load truck1) from 124 to 200
   goals met: 0 of 11
25. (lift hoist2 crate0 pallet2 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   changed: (fuel-cost) from 69 to 70
   goals met: 0 of 11
26. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 70 to 80
   goals met: 0 of 11
27. (load hoist2 crate0 truck0 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   changed: (current_load truck0) from 169 to 216
   goals met: 0 of 11
28. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 80 to 90
   goals met: 0 of 11
29. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   changed: (current_load truck1) from 200 to 282
   goals met: 0 of 11
30. (lift hoist0 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 pallet0)
   added: (lifting hoist0 crate3) (clear pallet0)
   changed: (fuel-cost) from 90 to 91
   goals met: 0 of 11
31. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   changed: (current_load truck0) from 216 to 312
   goals met: 0 of 11
32. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 91 to 101
   goals met: 0 of 11
33. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 101 to 111
   goals met: 0 of 11
34. (load hoist1 crate6 truck0 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   changed: (current_load truck0) from 312 to 385
   goals met: 0 of 11
35. (lift hoist1 crate2 pallet1 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist1) (on crate2 pallet1)
   added: (lifting hoist1 crate2) (clear pallet1)
   changed: (fuel-cost) from 111 to 112
   goals met: 0 of 11
36. (load hoist1 crate2 truck1 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   changed: (current_load truck1) from 282 to 347
   goals met: 0 of 11
37. (unload hoist1 crate9 truck1 distributor0)
   deleted: (in crate9 truck1) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck1) from 347 to 295
   goals met: 0 of 11
38. (load hoist1 crate9 truck0 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   changed: (current_load truck0) from 385 to 437
   goals met: 0 of 11
39. (unload hoist1 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck1) from 295 to 213
   goals met: 0 of 11
40. (drop hoist1 crate4 pallet1 distributor0)
   deleted: (lifting hoist1 crate4) (clear pallet1)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 pallet1)
   goals met: 1 of 11
41. (unload hoist1 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck0) from 437 to 390
   goals met: 1 of 11
42. (load hoist1 crate0 truck1 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck1) (available hoist1)
   changed: (current_load truck1) from 213 to 260
   goals met: 1 of 11
43. (unload hoist1 crate2 truck1 distributor0)
   deleted: (in crate2 truck1) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck1) from 260 to 195
   goals met: 1 of 11
44. (load hoist1 crate2 truck0 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   changed: (current_load truck0) from 390 to 455
   goals met: 1 of 11
45. (unload hoist1 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck0) from 455 to 359
   goals met: 1 of 11
46. (load hoist1 crate3 truck1 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   changed: (current_load truck1) from 195 to 291
   goals met: 1 of 11
47. (unload hoist1 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck0) from 359 to 280
   goals met: 1 of 11
48. (drop hoist1 crate7 crate4 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate4)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate4)
   goals met: 2 of 11
49. (unload hoist1 crate0 truck1 distributor0)
   deleted: (in crate0 truck1) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck1) from 291 to 244
   goals met: 2 of 11
50. (drop hoist1 crate0 crate7 distributor0)
   deleted: (lifting hoist1 crate0) (clear crate7)
   added: (available hoist1) (at crate0 distributor0) (clear crate0) (on crate0 crate7)
   goals met: 3 of 11
51. (unload hoist1 crate10 truck1 distributor0)
   deleted: (in crate10 truck1) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck1) from 244 to 208
   goals met: 3 of 11
52. (load hoist1 crate10 truck0 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck0) (available hoist1)
   changed: (current_load truck0) from 280 to 316
   goals met: 3 of 11
53. (unload hoist1 crate1 truck1 distributor0)
   deleted: (in crate1 truck1) (available hoist1)
   added: (lifting hoist1 crate1)
   changed: (current_load truck1) from 208 to 132
   goals met: 3 of 11
54. (drop hoist1 crate1 crate0 distributor0)
   deleted: (lifting hoist1 crate1) (clear crate0)
   added: (available hoist1) (at crate1 distributor0) (clear crate1) (on crate1 crate0)
   goals met: 4 of 11
55. (unload hoist1 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck0) from 316 to 280
   goals met: 4 of 11
56. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 112 to 122
   goals met: 4 of 11
57. (unload hoist2 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck0) from 280 to 190
   goals met: 4 of 11
58. (load hoist1 crate10 truck1 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck1) (available hoist1)
   changed: (current_load truck1) from 132 to 168
   goals met: 4 of 11
59. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 122 to 132
   goals met: 4 of 11
60. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 132 to 142
   goals met: 4 of 11
61. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 142 to 152
   goals met: 4 of 11
62. (unload hoist0 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck0) from 190 to 117
   goals met: 4 of 11
63. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   changed: (current_load truck1) from 168 to 241
   goals met: 4 of 11
64. (unload hoist0 crate9 truck0 depot0)
   deleted: (in crate9 truck0) (available hoist0)
   added: (lifting hoist0 crate9)
   changed: (current_load truck0) from 117 to 65
   goals met: 4 of 11
65. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 152 to 162
   goals met: 4 of 11
66. (drop hoist2 crate8 pallet2 distributor1)
   deleted: (lifting hoist2 crate8) (clear pallet2)
   added: (available hoist2) (at crate8 distributor1) (clear crate8) (on crate8 pallet2)
   goals met: 5 of 11
67. (unload hoist2 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist2)
   added: (lifting hoist2 crate2)
   changed: (current_load truck0) from 65 to 0
   goals met: 5 of 11
68. (drop hoist2 crate2 crate8 distributor1)
   deleted: (lifting hoist2 crate2) (clear crate8)
   added: (available hoist2) (at crate2 distributor1) (clear crate2) (on crate2 crate8)
   goals met: 6 of 11
69. (load hoist0 crate9 truck1 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck1) (available hoist0)
   changed: (current_load truck1) from 241 to 293
   goals met: 6 of 11
70. (unload hoist0 crate10 truck1 depot0)
   deleted: (in crate10 truck1) (available hoist0)
   added: (lifting hoist0 crate10)
   changed: (current_load truck1) from 293 to 257
   goals met: 6 of 11
71. (drop hoist0 crate10 pallet0 depot0)
   deleted: (lifting hoist0 crate10) (clear pallet0)
   added: (available hoist0) (at crate10 depot0) (clear crate10) (on crate10 pallet0)
   goals met: 7 of 11
72. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck1) from 257 to 161
   goals met: 7 of 11
73. (drop hoist0 crate3 crate10 depot0)
   deleted: (lifting hoist0 crate3) (clear crate10)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate10)
   goals met: 8 of 11
74. (unload hoist0 crate5 truck1 depot0)
   deleted: (in crate5 truck1) (available hoist0)
   added: (lifting hoist0 crate5)
   changed: (current_load truck1) from 161 to 125
   goals met: 8 of 11
75. (drop hoist0 crate5 crate3 depot0)
   deleted: (lifting hoist0 crate5) (clear crate3)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate3)
   goals met: 9 of 11
76. (unload hoist0 crate6 truck1 depot0)
   deleted: (in crate6 truck1) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck1) from 125 to 52
   goals met: 9 of 11
77. (drop hoist0 crate6 crate5 depot0)
   deleted: (lifting hoist0 crate6) (clear crate5)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate5)
   goals met: 10 of 11
78. (unload hoist0 crate9 truck1 depot0)
   deleted: (in crate9 truck1) (available hoist0)
   added: (lifting hoist0 crate9)
   changed: (current_load truck1) from 52 to 0
   goals met: 10 of 11
79. (drop hoist0 crate9 crate6 depot0)
   deleted: (lifting hoist0 crate9) (clear crate6)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 crate6)
   goals met: 11 of 11
